/********************************************************************************


 **** Copyright (C), 2024, Yuanlong Xu <Yono233@outlook.com>    ****
 **** All rights reserved                                       ****

 ********************************************************************************
 * File Name     : LoadApp.c
 * Author        : yono
 * Date          : 2025-08-19
 * Version       : 1.0
********************************************************************************/
/**************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include <includes.h>
/* Private types -------------------------------------------------------------*/
typedef void (*MCURESET)(void);
/* Private variables ---------------------------------------------------------*/
/* Private Constants ---------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

uint32_t LoadApp(void)
{
    InitNVIC( );

    MCURESET reset;
    //校验，从要跳转的地址中取出数据，然后校验地址是否在正常范围中
    if(((*(uint32_t *)MCUBOOT_APP_START_ADD) & 0x2FFE0000) == 0x20000000)
    {
        reset = (MCURESET) * (uint32_t *)(MCUBOOT_APP_START_ADD + 4);
        __set_MSP(*(uint32_t *)MCUBOOT_APP_START_ADD);
        __set_CONTROL(0);
        reset( );
    }

    return RETURN_DEFAULT;
}
