/**
 * LoadApp.h
 *
 *  Created on: 2024年3月13日
 *      Author: skonda15
 *
*/
/**
 *
 * 尝试load程序代码，跳转到用户程序
*/

#ifndef _LOAD_APP_H_
#define _LOAD_APP_H_

/* Includes ------------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/* Exported macros -----------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/

/* Exported variables ---------------------------------------------------------*/
/* Exported functions ---------------------------------------------------------*/

extern uint32_t LoadApp(void);

#endif /* _LOAD_APP_H_ */
