/**
 * SysInit.h
 *
 *  Created on: 2024年3月13日
 *      Author: yono
 *
*/
/**
 *
 * 系统功能初始化，跳转用户APP失败，进入升级程序时需要调用，支持升级程序的运行
*/

#ifndef _SYS_INIT_H_
#define _SYS_INIT_H_

/* Includes ------------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/* Exported macros -----------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/

/* Exported variables ---------------------------------------------------------*/
/* Exported functions ---------------------------------------------------------*/

extern void SysInit(void);
extern void InitNVIC(void);

#endif /* _SYS_INIT_H_ */
